package day02;
//变量的练习
public class VarDemo {
	public static void main(String[] args) {
		/*
		 * 要求: 1)题目不用抄  2)注释不用写  3)有错必须改
		 * 变量的练习:
		 * 1)声明一个整型的变量，名为a
		 *   声明三个整型的变量，名为b,c,d
		 * 2)声明整型变量e并直接赋值为36
		 *   声明整型变量f，
		 *     给变量f赋值为36
		 * 3)声明整型变量g并赋值为10
		 *     声明整型变量h并赋值为g+20，输出变量h的值
		 *     在g本身基础之上增20，输出变量g的值
		 *   声明整型变量i并赋值为3.14----------???
		 *   输出变量m的值---------------------???
		 *   声明整型变量m，输出变量m的值-------???
		 * 4)声明几个正确的和几个错误的变量
		 */
		
		
		
		
		
		
		
		
		
		
		
		
		
		//1.变量的声明:
		int a; //声明一个整型的变量，名为a
		int b,c,d; //声明三个整型的变量，名为b,c,d
		
		//2.变量的初始化:第一次赋值
		int e = 25; //声明整型变量e并赋值为25
		int f;  //声明整型变量f
		f = 25; //给变量f赋值为25
		
		//3.变量的使用:
		int g = 5; //声明整型变量g并赋值为5
		int h = g+10; //取出g的值5，加10后，再赋值给整型变量h
		System.out.println(h);   //输出变量h的值15
		System.out.println("h"); //输出h，双引号中的原样输出
		g = g+10; //取出g的值5，加10后，再赋值给g
		          //在g本身基础之上增10
		System.out.println(g); //输出15
		
		//int i = 34.567; //编译错误，数据类型不匹配
		//System.out.println(m); //编译错误，m未声明
		int m;
		//System.out.println(m); //编译错误，m未初始化
		
		//4.变量的命名:
		int a1,a_5$,_b7,$_;
		//int a*b; //编译错误，不能包含*号等特殊符号
		//int 1a; //编译错误，不能以数字开头
		int aa = 5;
		//System.out.println(Aa); //编译错误，严格区分大小写
		//int class; //编译错误，不能使用关键字
		int 年龄; //正确，但不建议
		int age; //建议"英文的见名知意"
		int score,myScore,myJavaScore; //建议"驼峰命名法"
		
	}
}













